//企业发放的奖金根据利润提成，提成方式如下：其中i为利润，b为奖金
#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>
#include<stdlib.h>
int main() {
	double i, b;
	printf("请输入本次利润\n");
	scanf("%lf", &i);
	if (i <= 10 && i >= 0) {
		b = 0.1* i;
	}
	if (i > 10 && i <= 20) {
		b = (i - 10)*0.075 + 10 * 0.1;
	}
	if (i > 20 && i <= 40) {
		b = (i - 20) * 0.05 + 10 * 0.1 + 10 * 0.075;
	}

	if (i > 40 && i <= 60) {
		b = (i - 40) *0.03 + 10 * 0.1 + 10 * 0.075 + 20 * 0.05;
	}

	if (i > 60 && i <= 100) {
		b = (i - 60)*0.015 + 10 * 0.1 + 10 * 0.075 + 20 * 0.05 + 20 * 0.03;
	}
	if (i > 100) {
		b = (i - 100) * 0.01 + 10 * 0.1 + 10 * 0.075 + 20 * 0.05 + 20 * 0.03 + 40 * 0.015;
	}
	printf("奖金为：%.2lf\n", b);
	system("pause");
	return 0;
}